<?php
namespace App\Http\Controllers;

use Illuminate\Http\Request;
use Illuminate\Http\Response;

use App\Http\Requests;
use App\Http\Controllers\Controller;
use App\Http\Controllers\SalonsController;
use App\Salon;

class RegionController extends Controller
{
    public function evaluateAreaName($area)
    {
        $areaname = array(
            '北海道' =>  array(
                '札幌市' => 1001,
                '札幌市以外' => 1002,
            ),
            '東北' => array(
                '青森県' => 2101,
                '秋田県' => 2201,
                '岩手県' => 2301,
                '山形県' => 2401,
                '宮城県' => array(
                    '仙台市' => 2501,
                    '仙台市以外' => 2502,
                ),
                '福島県' => 2601,
            ),
            '北陸' => array(
                '富山県' => 3101,
                '石川県' => 3201,
                '福井県' => 3301,
            ),
            '関東' => array(
                '東京都' => array(
                    '池袋・目白' => 4101,
                    '赤羽・王子・板橋・成増' => 4102,
                    '新宿・代々木・高田馬場・飯田橋' => 4103,
                    '練馬・大泉学園・荻窪・中野' => 4104,
                    '渋谷・青山・恵比寿' => 4105,
                    '明大前・三軒茶屋・自由が丘・駒沢' => 4106,
                    '赤坂・六本木・新橋' => 4107,
                    '品川・大森・蒲田・五反田' => 4108,
                    '上野・浅草・錦糸町・神田' => 4109,
                    '亀有・小岩・葛西' => 4110,
                    '北千住・竹ノ塚' => 4111,
                    '立川・八王子・福生・国分寺' => 4112,
                    '町田・多摩' => 4113,
                    '調布・吉祥寺・西東京' => 4114,
                ),
                '神奈川県' => array(
                    '横浜・上大岡・金沢・鶴見' => 4201,
                    '戸塚・瀬谷・青葉台・たまプラーザ' => 4202,
                    '川崎市' => 4203,
                    '横須賀・藤沢' => 4204,
                    '茅ヶ崎・平塚・小田原' => 4205,
                    '厚木・相模原・大和' => 4206,
                ),
                '埼玉県' => array(
                    'さいたま・川口・蕨' => 4301,
                    '越谷・久喜・春日部・草加' => 4302,
                    '所沢・川越・新座・和光' => 4303,
                    '熊谷・鴻巣・上尾' => 4304,
                ),
                '千葉県' => array(
                    '千葉・木更津' => 4401,
                    '柏・松戸' => 4402,
                    '船橋' => 4403,
                ),
                '群馬県' => 4501,
                '栃木県' => 4601,
                '茨城県' => 4701,
            ),
            '甲信越' => array(
                '新潟県' => 5101,
                '長野県' => 5201,
                '山梨県' => 5301,
            ),
            '東海' => array(
                '静岡県' => array(
                    '浜松' => 6101,
                    'その他静岡県' => 6102,
                ),
                '愛知県' => array(
                    '名駅・栄・金山' => 6201,
                    '藤が丘・今池・八事・野並' => 6202,
                    '小牧・北名古屋・一宮・春日井' => 6203,
                    '豊田・刈谷・岡崎・豊橋' => 6204,
                ),
                '岐阜県' => 6301,
                '三重県' => 6401,
            ),
            '関西' => array(
                '大阪府' => array(
                    '梅田・京橋・十三・新大阪' => 7101,
                    '心斎橋・難波・天王寺' => 7102,
                    '堺・岸和田・泉佐野・八尾' => 7103,
                    '枚方・寝屋川・東大阪' => 7104,
                    '豊中・池田・吹田・茨木' => 7105,
                ),
                '京都府' => 7201,
                '兵庫県' => array(
                    '神戸市内' => 7301,
                    'その他兵庫県' => 7302,
                ),
                '奈良県' => 7401,
                '滋賀県' => 7501,
                '和歌山県' => 7601,
            ),
            '中国' => array(
                '岡山県' => 8101,
                '広島県' => 8201,
                '鳥取県' => 8301,
                '島根県' => 8401,
                '山口県' => 8501,
            ),
            '四国' => array(
                '愛媛県' => 9101,
                '徳島県' => 9201,
                '香川県' => 9301,
                '高知県' => 9401,
            ),
            '九州・沖縄' => array(
                '福岡県' => array(
                    '福岡市内' => 10101,
                    'その他福岡県' => 10102,
                ),
                '熊本県' => 10201,
                '佐賀県' => 10301,
                '長崎県' => 10401,
                '大分県' => 10501,
                '宮崎県' => 10601,
                '鹿児島県' => 10701,
                '沖縄県' => 10801,
            ),

        );

        return $areaname[$area];
    }

    public function largeAreaEv($area)
    {
        $array = array(
            '北海道' => 1000,
            '東北' => 2000,
            '北陸' => 3000,
            '関東' => 4000,
            '甲信越' => 5000,
            '東海' => 6000,
            '関西' => 7000,
            '中国' => 8000,
            '四国' => 9000,
            '九州・沖縄 ' => 10000,
        );
        return $array[$area];
    }

    function areaEvaluate($area_code)
    {
        $evalarea = array(
            1000 => '北海道',
            1001 => '札幌市',
            1002 => '札幌市以外',
            2000 => '東北',
            2101 => '青森県',
            2201 => '秋田県',
            2301 => '岩手県',
            2401 => '山形県',
            2501 => '仙台市',
            2502 => 'その他宮城県',
            2601 => '福島県',
            3000 => '北陸',
            3101 => '富山県',
            3201 => '石川県',
            3301 => '福井県',
            4000 => '関東',
            4101 => '池袋・目白',
            4102 => '赤羽・王子・板橋・成増',
            4103 => '新宿・代々木・高田馬場・飯田橋',
            4104 => '練馬・大泉学園・荻窪・中野',
            4105 => '渋谷・青山・恵比寿',
            4106 => '明大前・三軒茶屋・自由が丘・駒沢',
            4107 => '赤坂・六本木・新橋',
            4108 => '品川・大森・蒲田・五反田',
            4109 => '上野・浅草・錦糸町・神田',
            4110 => '亀有・小岩・葛西',
            4111 => '北千住・竹ノ塚',
            4112 => '立川・八王子・福生・国分寺',
            4113 => '町田・多摩',
            4114 => '調布・吉祥寺・西東京',
            4201 => '横浜・上大岡・金沢・鶴見',
            4202 => '戸塚・瀬谷・青葉台・たまプラーザ',
            4203 => '川崎市',
            4204 => '横須賀・藤沢',
            4205 => '茅ヶ崎・平塚・小田原',
            4206 => '厚木・相模原・大和',
            4301 => 'さいたま・川口・蕨',
            4302 => '越谷・久喜・春日部・草加',
            4303 => '所沢・川越・新座・和光',
            4304 => '熊谷・鴻巣・上尾',
            4401 => '千葉・木更津',
            4402 => '柏・松戸',
            4403 => '船橋',
            4501 => '群馬県',
            4601 => '栃木県',
            4701 => '茨城県',
            5000 => '甲信越',
            5101 => '新潟県',
            5201 => '長野県',
            5301 => '山梨県',
            6000 => '東海',
            6101 => '浜松',
            6102 => 'その他静岡県',
            6201 => '名駅・栄・金山',
            6202 => '藤が丘・今池・八事・野並',
            6203 => '小牧・北名古屋・一宮・春日井',
            6204 => '豊田・刈谷・岡崎・豊橋',
            6301 => '岐阜県',
            6401 => '三重県',
            7000 => '関西',
            7101 => '梅田・京橋・十三・新大阪',
            7102 => '心斎橋・難波・天王寺',
            7103 => '堺・岸和田・泉佐野・八尾',
            7104 => '枚方・寝屋川・東大阪',
            7105 => '豊中・池田・吹田・茨木',
            7201 => '京都府',
            7301 => '神戸市内',
            7302 => 'その他兵庫県',
            7401 => '奈良県',
            7501 => '滋賀県',
            7601 => '和歌山県',
            8000 => '中国',
            8101 => '岡山県',
            8201 => '広島県',
            8301 => '鳥取県',
            8401 => '島根県',
            8501 => '山口県',
            9000 => '四国',
            9101 => '愛媛県',
            9201 => '徳島県',
            9301 => '香川県',
            9401 => '高知県',
            10000 => '九州・沖縄',
            10101 => '福岡市内',
            10102 => 'その他福岡県',
            10201 => '熊本県',
            10301 => '佐賀県',
            10401 => '長崎県',
            10501 => '大分県',
            10601 => '宮崎県',
            10701 => '鹿児島県',
            10801 => '沖縄県',
        );
        return $evalarea[$area_code];
    }

    public function descArea($area_floor)
    {
        $areadisc = array(
            10 => '北海道',
            //東北
            21 => '青森県',
            22 => '秋田県',
            23 => '岩手県',
            24 => '山形県',
            25 => '宮城県',
            26 => '福島県',
            //北陸
            31 => '富山県',
            32 => '石川県',
            33 => '福井県',
            //関東
            41 => '東京都',
            42 => '神奈川県',
            43 => '埼玉県',
            44 => '千葉県',
            45 => '群馬県',
            46 => '栃木県',
            47 => '茨城県',
            //甲信越
            51 => '新潟県',
            52 => '長野県',
            53 => '山梨県',
            //東海
            61 => '静岡県',
            62 => '愛知県',
            63 => '岐阜県',
            64 => '三重県',
            //関西
            71 => '大阪府',
            72 => '京都府',
            73 => '兵庫県',
            74 => '奈良県',
            75 => '滋賀県',
            76 => '和歌山県',
            //中国
            81 => '岡山県',
            82 => '広島県',
            83 => '鳥取県',
            84 => '島根県',
            85 => '山口県',
            //四国
            91 => '愛媛県',
            92 => '徳島県',
            93 => '香川県',
            94 => '高知県',
            //九州・沖縄
            101 => '福岡県',
            102 => '熊本県',
            103 => '佐賀県',
            104 => '長崎県',
            105 => '大分県',
            106 => '宮崎県',
            107 => '鹿児島県',
            108 => '沖縄県',
        );

        return $areadisc[$area_floor];
    }

    public function getExperiment(Request $request)
    {
        $salons = Salon::orderBy('id', 'asc')->get();
        return view('experiment', [
            'salons' => $salons,
        ]);
    }
}
